In [3]:
import pandas as pd
from pathlib import Path

resources = Path("resources")

In [4]:
schools_df = pd.read_csv(resources / "schools_complete.csv")
students_df = pd.read_csv(resources / "students_complete.csv")

In [5]:
complete_df = pd.merge(students_df, schools_df, on=["school_name", "school_name"])
complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [6]:
student_count = complete_df["Student ID"].count()
student_count

39170

In [7]:
schools = complete_df["school_name"].unique()
school_count = len(schools)
school_count

15

In [8]:
total_budget = schools_df["budget"].sum()
print(f"${total_budget:,}")

$24,649,428

In [9]:
students_df["reading_score"].mean()

81.87784018381414

In [10]:
students_df["math_score"].mean()

78.98537145774827

In [11]:
passing_math = complete_df[complete_df["math_score"] >= 70]
passing_reading = complete_df[complete_df["reading_score"] >= 70]
passing_math.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635

In [12]:
passing_reading.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [13]:
passing_math_count = passing_math["student_name"].count()
passing_reading_count = passing_reading["student_name"].count()
students_total = complete_df["student_name"].count()
passing_math_percentage = 100*passing_math_count / students_total
passing_reading_percentage = 100*passing_reading_count / students_total
print(f"Passing math {passing_math_percentage:.2f}%")
print(f"Passing reading {passing_reading_percentage:.2f}%")
average_math_score = complete_df["math_score"].mean()
average_reading_score = complete_df["reading_score"].mean()

Passing math 74.98%
Passing reading 85.81%

In [14]:
overall_passing = complete_df[(
    complete_df["math_score"] >= 70) &
    (complete_df["reading_score"] >= 70
)]
overall_passing.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [15]:
total_num_passed = overall_passing["student_name"].count()
overall_passing_percentage = 100 * total_num_passed / students_total
print(f"Total percent passed: {overall_passing_percentage:.2f}%")

Total percent passed: 65.17%

In [16]:
district_summary_df = pd.DataFrame([
    {"Total Schools": school_count,
    "Total Students": student_count,
    "Total Budget": total_budget,
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    "% Passing Math": passing_math_percentage,
    "% Passing Reading": passing_reading_percentage,
"% Overall Passing": overall_passing_percentage}
])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [17]:
f_general = lambda x: f"{x:,}"
f_money = lambda x: f"${x:,.2f}"
f_decimal0 = lambda x: f"{x:.0f}"
f_decimal1 = lambda x: f"{x:.1f}"
district_summary_df["Total Students"] = district_summary_df["Total Students"].map(f_general)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map(f_money)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map(f_decimal1)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map(f_decimal1)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map(f_decimal0)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map(f_decimal0)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map(f_decimal0)

In [18]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [19]:
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [20]:
per_school_types = schools_df.set_index(["school_name"])["type"]
per_school_types.head(3)

school_name
Huang High School       District
Figueroa High School    District
Shelton High School      Charter
Name: type, dtype: object

In [21]:
df = pd.DataFrame(per_school_types)
df.head(3)

                          type
school_name
Huang High School     District
Figueroa High School  District
Shelton High School    Charter

In [22]:
per_school_counts = schools_df["size"]
per_school_counts.head(3)

0    2917
1    2949
2    1761
Name: size, dtype: int64

In [23]:
per_school_counts = schools_df.set_index(["school_name"])["size"]
per_school_counts.head(3)

school_name
Huang High School       2917
Figueroa High School    2949
Shelton High School     1761
Name: size, dtype: int64

In [24]:
per_school_counts = schools_df["school_name"].value_counts()
per_school_counts.head(3)

Huang High School       1
Figueroa High School    1
Shelton High School     1
Name: school_name, dtype: int64

In [25]:
per_school_budget = schools_df.set_index(["school_name"])["budget"]
per_school_budget.head(3)

school_name
Huang High School       1910635
Figueroa High School    1884411
Shelton High School     1056600
Name: budget, dtype: int64

In [26]:
per_school_capita = per_school_budget / per_school_counts
per_school_capita.head(3)

school_name
Huang High School       1910635.0
Figueroa High School    1884411.0
Shelton High School     1056600.0
dtype: float64

In [27]:
student_school_math = students_df.set_index(["school_name"])["math_score"]
student_school_math.head(3)

school_name
Huang High School    79
Huang High School    61
Huang High School    60
Name: math_score, dtype: int64

In [28]:
per_school_averages = complete_df.groupby(["school_name"]).mean()
per_school_averages.head(3)

,Student ID,reading_score,math_score,School ID,size,budget
school_name,,,,,,
Bailey High School,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0
Cabrera High School,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0
Figueroa High School,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0

In [29]:
per_school_math = complete_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = complete_df.groupby(["school_name"]).mean()["reading_score"]
per_school_math.head(3)

school_name
Bailey High School      77.048432
Cabrera High School     83.061895
Figueroa High School    76.711767
Name: math_score, dtype: float64

In [30]:
per_school_reading.head(3)

school_name
Bailey High School      81.033963
Cabrera High School     83.975780
Figueroa High School    81.158020
Name: reading_score, dtype: float64

In [31]:
# To get the passing percentages, we need to:
# 1. Determine what is the passing grade.
# 2. Get the number of students who passed math and reading.
# 3. Get the students who passed math and passed reading

In [32]:
per_school_passing_math = complete_df[complete_df["math_score"] >= 70]
per_school_passing_reading = complete_df[complete_df["reading_score"] >= 70]
per_school_passing_math.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635

In [33]:
per_school_passing_reading.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [34]:
per_school_passing_math = per_school_passing_math.groupby(["school_name"]).count()["student_name"]
per_school_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]
per_school_passing_math.head(3)

school_name
Bailey High School      3318
Cabrera High School     1749
Figueroa High School    1946
Name: student_name, dtype: int64

In [35]:
per_school_passing_reading.head(3)

school_name
Bailey High School      4077
Cabrera High School     1803
Figueroa High School    2381
Name: student_name, dtype: int64

In [36]:
per_school_passing_math = 100 * per_school_passing_math / per_school_counts
per_school_passing_reading = 100 * per_school_passing_reading / per_school_counts
per_school_passing_math.head(3)

Bailey High School      331800.0
Cabrera High School     174900.0
Figueroa High School    194600.0
dtype: float64

In [37]:
per_school_passing_reading.head(3)

Bailey High School      407700.0
Cabrera High School     180300.0
Figueroa High School    238100.0
dtype: float64

In [38]:
per_passing_math_reading = complete_df[
    (complete_df["math_score"] >= 70) &
    (complete_df["reading_score"] >= 70)]
per_passing_math_reading.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [39]:
per_passing_math_reading_mean = per_passing_math_reading.groupby(["school_name"]).mean()
per_passing_math_reading_mean.head(3)

,Student ID,reading_score,math_score,School ID,size,budget
school_name,,,,,,
Bailey High School,20373.668628,84.336889,84.429570,7.0,4976.0,3124928.0
Cabrera High School,16941.093695,84.414260,84.015910,6.0,1858.0,1081356.0
Figueroa High School,4392.129382,84.797960,84.090504,1.0,2949.0,1884411.0

In [40]:
per_passing_math_reading_count = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]
per_passing_math_reading_count.head(3)

school_name
Bailey High School      2719
Cabrera High School     1697
Figueroa High School    1569
Name: student_name, dtype: int64

In [41]:
per_overall_passing_percentage = per_passing_math_reading_count / per_school_counts * 100
per_overall_passing_percentage.head(3)

Bailey High School      271900.0
Cabrera High School     169700.0
Figueroa High School    156900.0
dtype: float64

In [42]:
per_school_summary_df = pd.DataFrame({
             "School Type": per_school_types,
             "Total Students": per_school_counts,
             "Total School Budget": per_school_budget,
             "Per Student Budget": per_school_capita,
             "Average Math Score": per_school_math,
           "Average Reading Score": per_school_reading,
           "% Passing Math": per_school_passing_math,
           "% Passing Reading": per_school_passing_reading,
           "% Overall Passing": per_overall_passing_percentage})
per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,1,3124928,3124928.0,77.048432,81.033963,331800.0,407700.0,271900.0
Cabrera High School,Charter,1,1081356,1081356.0,83.061895,83.975780,174900.0,180300.0,169700.0
Figueroa High School,District,1,1884411,1884411.0,76.711767,81.158020,194600.0,238100.0,156900.0
Ford High School,District,1,1763916,1763916.0,77.102592,80.746258,187100.0,217200.0,148700.0
Griffin High School,Charter,1,917500,917500.0,83.351499,83.816757,137100.0,142600.0,133000.0

In [43]:
per_school_summary_df["Total School Budget"] = per_school_summary_df["Total School Budget"].map("${:,.2f}".format)
per_school_summary_df["Per Student Budget"] = per_school_summary_df["Per Student Budget"].map("${:,.2f}".format)
per_school_summary_df.head(3)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,1,"$3,124,928.00","$3,124,928.00",77.048432,81.033963,331800.0,407700.0,271900.0
Cabrera High School,Charter,1,"$1,081,356.00","$1,081,356.00",83.061895,83.975780,174900.0,180300.0,169700.0
Figueroa High School,District,1,"$1,884,411.00","$1,884,411.00",76.711767,81.158020,194600.0,238100.0,156900.0

In [44]:
new_column_order = ["School Type", "Total Students", "Total School Budget", "Per Student Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
per_school_summary_df = per_school_summary_df[new_column_order]
per_school_summary_df.head(3)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,1,"$3,124,928.00","$3,124,928.00",77.048432,81.033963,331800.0,407700.0,271900.0
Cabrera High School,Charter,1,"$1,081,356.00","$1,081,356.00",83.061895,83.975780,174900.0,180300.0,169700.0
Figueroa High School,District,1,"$1,884,411.00","$1,884,411.00",76.711767,81.158020,194600.0,238100.0,156900.0

In [45]:
top_schools = per_school_summary_df.sort_values(["% Overall Passing"], ascending=False)
top_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,1,"$3,124,928.00","$3,124,928.00",77.048432,81.033963,331800.0,407700.0,271900.0
Johnson High School,District,1,"$3,094,650.00","$3,094,650.00",77.072464,80.966394,314500.0,386700.0,254900.0
Hernandez High School,District,1,"$3,022,020.00","$3,022,020.00",77.289752,80.934412,309400.0,374800.0,248100.0
Rodriguez High School,District,1,"$2,547,363.00","$2,547,363.00",76.842711,80.744686,265400.0,320800.0,211900.0
Wilson High School,Charter,1,"$1,319,574.00","$1,319,574.00",83.274201,83.989488,214300.0,220400.0,206800.0

In [46]:
bottom_schools = per_school_summary_df.sort_values(["% Overall Passing"], ascending=True)
bottom_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Holden High School,Charter,1,"$248,087.00","$248,087.00",83.803279,83.814988,39500.0,41100.0,38100.0
Pena High School,Charter,1,"$585,858.00","$585,858.00",83.839917,84.044699,91000.0,92300.0,87100.0
Griffin High School,Charter,1,"$917,500.00","$917,500.00",83.351499,83.816757,137100.0,142600.0,133000.0
Ford High School,District,1,"$1,763,916.00","$1,763,916.00",77.102592,80.746258,187100.0,217200.0,148700.0
Thomas High School,Charter,1,"$1,043,130.00","$1,043,130.00",83.418349,83.848930,152500.0,159100.0,148700.0

In [47]:
grades = ["9th", "10th", "11th", "12th"]
grades_dfs = [complete_df[complete_df["grade"] == grade]
            for grade in grades]

In [53]:
# Math scores
math_scores_df = pd.DataFrame()
for grade, df in zip(grades, grades_dfs):
    series = df.groupby("school_name").mean(
    )["math_score"].map("{:.1f}".format)
    series.index.name = ""
    math_scores_df[grade] = series
math_scores_df.head()

                       9th  10th  11th  12th

Bailey High School    77.1  77.0  77.5  76.5
Cabrera High School   83.1  83.2  82.8  83.3
Figueroa High School  76.4  76.5  76.9  77.2
Ford High School      77.4  77.7  76.9  76.2
Griffin High School   82.0  84.2  83.8  83.4

In [52]:
reading_scores_df = pd.DataFrame()
for grade, df in zip(grades, grades_dfs):
    series = df.groupby("school_name").mean(
    )["reading_score"].map("{:.1f}".format)
    series.index.name = ""
    reading_scores_df[grade] = series
reading_scores_df.head()

                       9th  10th  11th  12th

Bailey High School    81.3  80.9  80.9  80.9
Cabrera High School   83.7  84.3  83.8  84.3
Figueroa High School  81.2  81.4  80.6  81.4
Ford High School      80.6  81.3  80.4  80.7
Griffin High School   83.4  83.7  84.3  84.0